src/cf/DataProcessors/GDS_ПанельНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>GDS_ПанельНастроек</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/GDS_ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/GDS_ПанельНастроек/Forms/СписокСотрудниковДоступНеЗапрещается/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсключаемыеФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ИсключаемыеФизическиеЛица.ДатаБлокировки КАК ДатаБлокировки,
	|	ИсключаемыеФизическиеЛица.Примечание КАК Примечание
	|ИЗ
	|	РегистрСведений.GDS_ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица КАК ИсключаемыеФизическиеЛица";
	
	ИсключаемыеФизическиеЛица.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СохранитьНастройкиНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	НаборЗаписей = РегистрыСведений.GDS_ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица.СоздатьНаборЗаписей();
	Для Каждого ДанныеФизическогоЛица Из ИсключаемыеФизическиеЛица Цикл 
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ДанныеФизическогоЛица);
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
